//-----------------------------------------------------
//ステータス
float hungry = 94;//空腹ゲージ（食べ物で回復）,0→空腹　94→満腹
int money = 1000000;//金。筋トレをするともらえる。ギャンブルで増やせる。
int muscle_p = 0;//マッスルポイント。運動すればするだけ増加。キャラの進化に関わる。
int muscle_p_b = 0;//マッスルポイント増加率
int money_b = 0;//マネー増加率
//-----------------------------------------------------

//-----------------------------------------------------
//アイテム(所持数によって管理)
int Item_kazu [] = {0,0,0,0,32767};
//チョコ,プロテイン,サラダチキン,ヨガマット,ダンベル

//-----------------------------------------------------

//-----------------------------------------------------
//キャラクターの動き(仮)
float x = 150;
float y = 250;
float dx = 0.3;
float dy = 1;
int a = 0;
//-----------------------------------------------------
  int CM = 0;
void Character(){

  dy = int(random(-2,2));
  // fill(100,100,200);
  if(muscle_p<10000){
   x = x+dx;
   if(x>280){
    dx = -dx ;
    CM = 1;
   }else if(x<30){
    dx = -dx; 
   CM = 0;
   }
  }else if(muscle_p>=10000){
    x = x+dx;
   if(x>200){
    x = 200;
    dx = -dx ;
    CM = 1;
   }else if(x<20){
    dx = -dx; 
   CM = 0;
   }
  }
   //circle(x,y+dy,50);
   if(CM == 0 &&  muscle_p < -1000){//超でぶ
   image(C5,150,230,200,200);
   }else if(CM == 1 &&  muscle_p < -1000){
   image(C5,150,230,200,200);
   }
   
   if(CM == 0 && muscle_p >=-1000 && muscle_p < 0){//でぶ
   image(C42,x,230,200,200);
   }else if(CM == 1 && muscle_p >=-1000 && muscle_p < 0){
   image(C4,x,230,200,200);
   }
   
   if(CM == 0 && muscle_p >=0 && muscle_p < 3500){//ふつう
   image(C32,x,230,200,200);
   }else if(CM == 1 && muscle_p >=0 && muscle_p < 3500){
   image(C3,x,230,200,200);
   }
   
   if(CM == 0 && muscle_p >=3500 && muscle_p < 10000){//マッチョ
   image(C22,x,230,200,200);
   }else if(CM == 1 && muscle_p >=3500 && muscle_p < 10000){
   image(C2,x,230,200,200);
   }
   
   if(CM == 0 && muscle_p >=10000){//ごりまちょ
   image(C12,x,140,300,300);
   }else if(CM == 1  && muscle_p >=10000){
   image(C1,x,140,300,300);
   }
   
}
