String menu [][] ={
                    {"その他","きんとれ","あいてむ"},//home0
                    {"もどる","きろく","ハイロー"},//あそぶ1
                    {"もどる","トレ１","トレ２"},//きんとれ2
                    {"もどる"," かう","えらぶ"},//しょっぷ3
                    {"おわる","スタート","せってい"},//タイトル4
                    {"もどる","へんこう","えらぶ"},//せってい5
                    {"もどる","トレ１","トレ２"},//きんとれ6
                    {"もどる","ふっきん","うでたて"},//きんとれ7
                    {"もどる","ﾊﾞｰﾋﾟｰ","ｽｸﾜｯﾄ"},//きんとれ8       
                    {"もどる","もちもの","しょっぷ"},//あいてむ９   
                    {"もどる","あげる","えらぶ"},//あいてむ10
                    {"もどる","はじめる","ないよう"},//トレーニング11
                    {"もどる","   ","   "},//12
                    {"もどる","あそぶ","ないよう"},//13
                    {"やめる"," ロー "," ハイ "},//14
                    {"やめる","    "," 続ける "},//15
                    {"やめる","    "," リトライ "},//16
                    {"やめる","    "," 続ける "},//17
                    };

void Menubar(int a){
 fill(190,190,190);
 rect(20,450,440,30);
 fill(0,0,0);
 stroke(a);
 for(int i =0; i<3; i++){
 line(20+(i*146),450,20+(i*146),490);
 textSize(20);
 text(menu[a][i],55+(i*146),470);
 }
 line(20,450,460,450);
 noStroke();
}
